import { Page } from './../../pages/page.entity';
import { Category } from './../../categories/category.entity';
import { Connection, getManager,getRepository } from 'typeorm';
import { Factory, Seeder } from 'typeorm-seeding';


export class PageCreateSeed implements Seeder {
  public async run(factory: Factory, connection: Connection): Promise<void> {
		const pages = await getRepository(Page).find();
		if(pages.length) return;


		await factory(Page)().create({
			title_ar: 'سياسه الخصوصيه',
			title_en: 'Privacy Policy',
			slug: "privacy-policy",
			content: '. دليل الصفحات الزرقاء أكبر موسوعة تجارية صناعية بالمملكة العربية السعودية صادر عن غرفة الرياض ,صادر عن عرفة جدة,صادر عن غرفة مكة المكرمة ,صادر عن المدينة المنورة , تميز ومصداقية وانتشار , أكبر مرجع معلوماتي للمنشات التجارية والصناعية بالمملكة , تحديث كامل للمعلومات, انتشار واسع داخل المملكة وخارج المملكة وذالك من خلال الموقع الالكتروني وتطبيق الجوال والدليل المطبوع, امكانية البحث عن البيانات بالاسم والنشاط , وأصبح لدينا من الخبرات والطاقات ما يؤهلنا لأن نقدم خدماتنا لتلبية احتياجات عملائنا المتعاملين معنا من خلال أكبر موسوعة تجارية صناعية ومعلوماتية والأكير انتشارا داخل وخارج المملكة مع التوزيع المجاني من خلال الغرف التجارية الصناعية',
		});
		await factory(Page)().create({
			title_ar: 'تواصل معنا',
			title_en: 'Contact Us',
			slug: "contact-us",
			content: '. دليل الصفحات الزرقاء أكبر موسوعة تجارية صناعية بالمملكة العربية السعودية صادر عن غرفة الرياض ,صادر عن عرفة جدة,صادر عن غرفة مكة المكرمة ,صادر عن المدينة المنورة , تميز ومصداقية وانتشار , أكبر مرجع معلوماتي للمنشات التجارية والصناعية بالمملكة , تحديث كامل للمعلومات, انتشار واسع داخل المملكة وخارج المملكة وذالك من خلال الموقع الالكتروني وتطبيق الجوال والدليل المطبوع, امكانية البحث عن البيانات بالاسم والنشاط , وأصبح لدينا من الخبرات والطاقات ما يؤهلنا لأن نقدم خدماتنا لتلبية احتياجات عملائنا المتعاملين معنا من خلال أكبر موسوعة تجارية صناعية ومعلوماتية والأكير انتشارا داخل وخارج المملكة مع التوزيع المجاني من خلال الغرف التجارية الصناعية',
		});
  }
}
